In [1]:
import pandas as pd
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_is_numpy_dev',
 '_lib',
 '_libs',
 '_np_version_under1p17',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [8]:
d1=pd.DataFrame({'Clg':['GIST','SVCE','JNTUA'],
                'TEMP':[35,36,37,],
                'HUM':[45,456,47]})
d1

     Clg  TEMP  HUM
0   GIST    35   45
1   SVCE    36  456
2  JNTUA    37   47

In [7]:
d2=pd.DataFrame({'Clg':['GTNN','JNTUK','JNTUH'],
                'TEMP':[35,45,37,],
                'HUM':[45,46,49]})
d2

     Clg  TEMP  HUM
0   GTNN    35   45
1  JNTUK    45   46
2  JNTUH    37   49

In [9]:
import pandas as pd
d3=pd.concat((d1,d2))
d3

     Clg  TEMP  HUM
0   GIST    35   45
1   SVCE    36  456
2  JNTUA    37   47
0   GTNN    35   45
1  JNTUK    45   46
2  JNTUH    37   49

In [15]:
import pandas as pd
d3=pd.concat((d1,d2)),keys["m1,m2"]
d3

NameError: name 'keys' is not defined

In [16]:
d1=pd.DataFrame({'Clg':['GIST','SVCE','JNTUA'],
                'TEMP':[35,36,37,],
                'HUM':[45,456,47]})
d1

     Clg  TEMP  HUM
0   GIST    35   45
1   SVCE    36  456
2  JNTUA    37   47

In [17]:
d1

     Clg  TEMP  HUM
0   GIST    35   45
1   SVCE    36  456
2  JNTUA    37   47

In [21]:
g1=d1.groupby(by='TEMP')
g1

In [22]:
g1.max()

        Clg  HUM
TEMP
35     GIST   45
36     SVCE  456
37    JNTUA   47

In [23]:
d1=g1.max()
d1

        Clg  HUM
TEMP
35     GIST   45
36     SVCE  456
37    JNTUA   47

In [24]:
d1

        Clg  HUM
TEMP
35     GIST   45
36     SVCE  456
37    JNTUA   47

In [26]:
g2=d1.groupby('by=HUM')
g2

KeyError: 'by=HUM'